package Actions;

public class CountryInformation {
		public static final String[] COUNTRIES = new String[] {
				"Россия", "Германия", "Габон", "Украина",
				"Португалия", "Италия", "Испания", "Сенегал"
		};
		public static final String[] INFORMATION = new String[] {
				"Россия или Российская Федерация — государство\n"
				+ " в Восточной Европе и Северной Азии. Территория России \n"
				+ "в её конституционных границах составляет 17 125 191 км²; \n"
				+ "население страны (в пределах её заявленной территории) \n"
				+ "составляет 146 171 015 чел. (2021). Занимает первое место \n"
				+ "в мире по территории, шестое — по объёму ВВП по ППС, и \n"
				+ "девятое — по численности населения.",
				
				"Германия, официальное название — Федерати́вная Респу́блика \n"
				+ "Герма́ния (нем. Bundesrepublik Deutschland), ФРГ — \n"
				+ "государство в Центральной Европе. Площадь территории \n"
				+ "— 357 408,74 км². Численность населения на 30 сентября \n"
				+ "2019 года — 83 149 300 жителей. Занимает 19-е место в \n"
				+ "мире по численности населения (2-е в Европе) и 62-е в \n"
				+ "мире по территории (8-е в Европе). ",
				"Габон, полная официальная форма — Габонская Республика \n"
				+ "(фр. République gabonaise) — государство в Центральной \n"
				+ "Африке, бывшая колония Франции. Население, по переписи \n"
				+ "2013 года, составило 1 811 079 человек, территория \n"
				+ "— 267 667 км². Занимает 145-е место в мире по численности \n"
				+ "населения и 78-е по территории. ",
				
				"Украина — государство в Восточной и частично Центральной \n"
				+ "Европе. Территория в пределах международно признанных \n"
				+ "границ — 603 549 км². Население по оценкам государственной \n"
				+ "службы статистики Украины на 1 сентября 2020 года — \n"
				+ "41 554 361 постоянный житель и 41 723 998 человек наличного \n"
				+ "населения. Занимает 34-е место в мире по численности \n"
				+ "населения, 44-е по территории. Украина является первым по \n"
				+ "размеру территории европейским государством, целиком \n"
				+ "находящимся в Европе. ",
				
				"Португалия, официально — Португальская Республика \n"
				+ "(порт. República Portuguesa) — самое западное государство \n"
				+ "в континентальной Европе, расположенное в юго-западной \n"
				+ "части Пиренейского полуострова. На севере и востоке \n"
				+ "граничит с Испанией, на юге и западе омывается Атлантическим \n"
				+ "океаном; таким образом, это государство в целом представляет \n"
				+ "собой полуанклав, или прибрежный анклав. Название страны \n"
				+ "происходит от города Порту. Официальным и национальным \n"
				+ "языком является португальский.\n"
				+ "Причислена к развитым странам мира. Республика с 1910 года. \n"
				+ "Унитарное государство. ",
				
				"Италия, официальное название — Итальянская Республика \n"
				+ "(итал. Repubblica Italiana) — государство в Южной Европе, \n"
				+ "в центре Средиземноморья. Входит в Европейский союз и НАТО \n"
				+ "с момента их создания, является третьей по величине экономикой \n"
				+ "еврозоны. Граничит с Францией на северо-западе (протяжённость \n"
				+ "границы — 488 км), Швейцарией (740 км) и Австрией (430 км) — \n"
				+ "на севере, Словенией — на северо-востоке (232 км).\n"
				+ "Внутри территории Италии находятся два государства-анклава: \n"
				+ "государство Сан-Марино и расположенное внутри территории \n"
				+ "Рима ассоциированное с Италией государство Ватикан, с каждым \n"
				+ "из которых Италия имеет внутреннюю границу протяжённостью \n"
				+ "соответственно 39 км и 3,2 км. ",
				
				"Испания, официально Королевство Испания — \n"
				+ "трансконтинентальное суверенное государство в Южной Европе, \n"
				+ "имеющая часть территорий в Африке. Член Европейского союза \n"
				+ "и НАТО. \n"
				+ "Испания занимает большую часть (80 %) Пиренейского \n"
				+ "полуострова, а также Канарские и Балеарские острова, имеет \n"
				+ "общую площадь 504 782 км² (вместе с небольшими суверенными \n"
				+ "территориями на африканском побережье, городами Сеута и \n"
				+ "Мелилья)являясь четвёртой по величине страной в Европе \n"
				+ "(после России, Украины и Франции). ",
				
				"Сенегал, официально — Республика Сенегал — государство в \n"
				+ "Западной Африке, к югу от реки Сенегал, по которой страна \n"
				+ "получила своё название. На западе находится Атлантический \n"
				+ "океан, страна граничит с Мавританией на севере, Мали — на \n"
				+ "востоке и Гвинеей и Гвинеей-Бисау — на юге. Внутри \n"
				+ "территории находится государство Гамбия, простираясь от \n"
				+ "Атлантического океана вглубь Сенегала примерно на 300 км. "
		};
}
